# Да се напише програма, която въвежда час и минути от 24-часово денонощие и изчислява колко ще е часът след 15 минути.
# Резултатът да се отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59.
# Часовете се изписват с една или две цифри.
# Минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо.

hours = int(input())
minutes = int(input())

minutes += 15
hours += minutes / 60
hours %= 24
minutes %= 60

print('{0}:{1:02}'.format(int(hours), int(minutes)))
